{"id":"eecd5a424dcd99161dee6705b","tags":[],"name":"Cannibal Fury","type":"Haunt","level":"15","traits":"","actions":"","body":"Complexity Complex\nPerception DC 35 (Expert) to hear the sound of faint repetitive knocking somewhere in the cabin\nDescription This haunt starts innocently enough, with strange sounds from elsewhere in the cabin indicating that the PCs aren’t the only ones here. These sounds rapidly grow in power, until it seems as if an entire army of invisible, shrieking lunatics is on the loose. This persistent haunt plays out over 11 rounds, following a scripted series of actions. Allow the PCs to take their own actions as they wish each round; the haunt’s actions always occur on initiative count 10.\nDisable Religion DC 43 (master) to calm the spirits from round 5 onwards\nDying for a bite (Incapacitation, Mental, Necromancy, Possession) \nTrigger timed\nEffect This persistent haunt adheres to the following round-by round schedule. Note that until the haunt begins to act in force on the fifth round, it cannot be dismissed or damaged. These first four rounds are, in effect, an extended warning of what’s about to occur.\n**Rounds 1–3:** Allow the PCs to each make a DC 35 Perception check. Anyone who succeeds hears a faint knocking coming from the lower portion of the cabin, probably the outer door at area B3, as if some lost traveler were seeking shelter from the storm. PCs in the lower rooms of the cabin or the stair shaft need only succeed at a DC 25 Perception check to hear this knocking. The knocking continues for 3 rounds, during which time PCs might head down to see whom it might be. Attempts to see the ground outside the cabin are fruitless due to the whirling snow flurries, unless the PCs are within 5 feet, and then they still see nothing present that could have caused the knocking.\n**Round 4:** The strange knocking grows silent for 1 round.\n**Round 5:** A loud crack followed by a mighty hammering sound suddenly fills the cabin as its walls begin to shake and groan, almost as if the structure were giving up its purchase on the cliff edge and sliding off. On each turn that a PC remains in the haunt’s area, he must make a DC 36 Acrobatics check; failure indicates he cannot move for that round,  while failure by 5 or more indicates he falls prone. A character in area B6 at this time falls off the stairs if he falls prone.\n**Round 6:** The hammering continues, but now the faint images of starving dwarven ghosts can be glimpsed out of the corner of the eye. Each character suddenly experiences painful hunger pangs and must succeed at a DC 36 Fortitude save to resist taking 4d6 points of nonlethal damage and become fatigued from the horrific hunger.\n**Round 7:** Voices can now be heard, in most cases wordless cries of pain, but now and then snatches of sentences like “eating us…” or “don’t let him…” or “so hungry….” The hammering continues, but now the starving ghosts seem to notice the PCs for the first time. Each PC must make a DC 36 Will save — failure indicates that the haunt possesses him as the ghosts themselves seem to flow into the PC’s body. Possession causes Stupefied 1 for 1 minute, and has additional implications in rounds 8–10.\n**Round 8–10:** For the last 3 rounds of this complex haunt, the shaking and hammering continues. Characters possessed by the haunt do not need to make Acrobatics checks to move and take whatever actions they can to render non-possessed characters unconscious or helpless, using whatever tools they have at their disposal. If a possessed character is adjacent to a helpless, non-possessed character and is not threatened by any other non-possessed character, he attempts a full round of attacks against the helpless character with the best weapon option he has. If a possessed character is adjacent to a dead character, he feeds on the body and takes no other actions unless he is attacked by someone else.\n**Round 11:** With a sudden lurch, the haunting stops. Possessed characters immediately regain control of their faculties. Any character who successfully fed on an ally must make a DC 36 Will save upon realizing what he’s done — failure results in an additional level of Stupefied from the supernaturally fueled revelation and the condition now lasts 1 day. The cabin itself shows no signs of damage from the violence aside from anything the PCs themselves have done to it. A few rounds later, Silas Vekker finally manifests before the PCs as detailed in Event 2, below.\nReset none","plain":0,"meta":{"public":0,"url":"Odz7OvlF"}}