{"id":"e8cfe4a1d53f48f7de244edc5","tags":[],"name":"Chellan, Sword of Greed","type":"weapon","level":"22","traits":"Unique, Artifact, Magical, Transmutation","actions":"","body":"The blade of this +4 major striking scimitar is made of magically hardened gold that functions as an adamantine weapon. It is incredibly heavy and requires a strength modifier of at least 4 to wield one handed without penalty. Its high density increases its damage by one step. \n\nActivate (r) envision (transmutation, incapacitation); Frequency You critically succeed on a Strike with the weapon, and deal damage. The target must be a living creature made of flesh; Effect The target must succeed at a Fortitude save of your class DC or be slowed 1 until the end of your next round. Subsequent critical hits using this reaction increase the slow effect by 1 and extend its duration for another round. When a creature is unable to act due to the slowed condition from this ability, the creature is permanently non-magically petrified and turned to crystal. \n\nCharacters turned to crystal by Chellan appear to be made of ruby, diamond, or some other valuable gem, but are in fact merely colored quartz of little value to looters, other than perhaps artistic value.\n\n**Curse:** Chellan has an empathic link to the Runelord of Greed, and while it has no master, anyone sleeping within 30 feet of it will be subject to subtle influence bending them to his will. For anyone with at least master proficiency with martial weapons and a strength modifier of at least 4 this manifests as below:\n  - After each nights rest in its presence they are subject to a mental effect with a DC 40 Will save; on a failure this becomes their most valued possession. Successes have no effect. After 7 failures in total or a single critical failure they become the next champion of greed and they kill anyone who stands in their way. \n  - Separating them from the weapon for 24 hours, during which they do everything in their power to recover it, allows a new save each day. Failures have no effect. 7 successes in total or a single critical success frees them of the curse.\n\n**Destruction:** Karzoug (or the current Runelord of greed) can destroy the sword of greed merely by commanding its destruction with his voice (a free action for the runelord). \n**Special:** Its runes and other abilities only function while there is a runelord of Greed, and this is signified by a prominent greed rune. If Karzoug dies then it just becomes equivalent to a heavy adamantine weapon and the greed rune fades to nothing.","plain":0,"meta":{"public":0,"url":"WOHtrT7V"}}