{"id":"e8cfe4a1d53f48f7de244edc5","tags":[],"name":"Chellan, Sword of Greed","type":"weapon","level":"21","traits":"Unique, Artifact, Magical, Transmutation","actions":"","body":"The blade of this +4 major striking sword is made of magically hardened gold that functions as an adamantine weapon. It is incredibly heavy and requires strength 18 or greater to wield one handed. Its high density increases its damage by one step. Its Runes and other abilities only function while there is a runelord of Greed. If Karzoug dies then it becomes equivalent to a heavy adamantine weapon.\n\nActivate (r) envision (transmutation, incapacitation); Frequency You critically succeed on a Strike with the weapon, and deal damage. The target must be a living creature made of flesh; Effect The target must succeed at a DC 41 Fortitude save or be slowed 1 for 1 round. Subsequent critical hits using this reaction increase the slow effect by 1 and extend its duration for another round. When a creature is unable to act due to the slowed condition from this ability, the creature is permanently non-magically petrified and turned to crystal. \n\nCharacters turned to crystal by Chellan appear to be made of ruby, diamond, or some other valuable gem, but are in fact merely colored quartz of little value to looters.\n\nChellan has an empathic link to the Runelord of Greed, and anyone wielding or carrying it will be subject to subtle influence bending them to its will. This immediately manifests with thoughts of becoming the best fighter in the world with this amazing weapon. After each 24 hours of carrying it they are subject to a domination effect with a DC 40 Will save; on a critical failure they become the next champion of greed. They kill anyone who stands in their way. Separating them from the weapon for 24 hours, during which they do everything in their power to recover it, allows a new save. \n**Destruction:** Karzoug (or the current Runelord of greed) can destroy the sword of greed merely by commanding its destruction with his voice (a free action for the runelord).","plain":0,"meta":{"public":0,"url":"WOHtrT7V"}}