{"id":"e4f5cafe0565a4911d13208db","tags":[],"name":"Slashing Cage Trap","type":"hazard","level":4,"traits":"complex, trap, mechanical, magical","actions":"","body":"Stealth +13 (trained)\nDescription Two hidden iron portcullises are recessed into the ceiling around the polished section of floor, as indicated on the map. When a creature steps between them, a pressure plate causes them to both drop with a clang; 1 round later, the two statues began slashing at the space between them, cutting the trapped intruder to ribbons.\n<hr />\nDisable DC 17 Crafting (expert) or DC 19 Thievery (trained) to pry open the portcullises. A lever that raises and lowers the portcullises and switches the trap on and off can be found in area <strong>E4</strong>.\nAC 21; Fort +14; Ref +8;\n<strong>Hardness</strong> 11 <strong>HP</strong> 46 (BT 23) <strong>Immunities</strong> critical hits, object immunities, precision damage\n<strong>Glaive Flurry</strong> (r) Trigger A creature is trapped within the portcullises at the beginning of the Slashing Cage Trap's turn. Effect Each statue swings it's glaive into the area, slicing the captured creature. The creature makes a DC 21 Reflex save. \nCritical Success Same as success, but the creature can take a Step action to free themselves of the trapped area;\nSuccess The creature avoids the glaives, taking no damage;\nFailure the creature takes 2d8+6 slashing damage;\nCritical Failure The creature takes 4d8+12 slashing damage.\n<hr />\nRoutine (a) Each round, the Slashing Cage Trap makes a Glaive Flurry attack against the creature trapped between the portcullises.\n<hr />\nReset Two rounds after the trap activates, a 10-foot-deep pit opens in the square, dumping what remains of the victim into the area below before the whole thing resets itself. A still living victim can attempt a DC 17 Reflex save to avoid falling into the pit by either clinging to the portcullises or the statue alcoves, but when the pit closes automatically 1 round later, the victim’s weight on the lid could start the cycle all over again.","plain":0,"meta":{"public":1,"url":"llQMfrvX"}}